{"meta":{"title":"Mingkonic's blog","subtitle":"Welcome！","description":"爱折腾得到程序猿","author":"Mingkonic","url":"http://mingkonic.work","root":"/"},"pages":[{"title":"关于","text":"# 关于我 我是 Mingkonic，00 后，目前是小白一枚。 虽然心中不甘，但是目前确实是 Worst One 。 目标是成为自己心中的样子。虽然前路迷茫，但是我会一步一步往前走。 # 关于主题 我是根据 Hexo - LiveForCode 博客样式复制过来的，感谢该主题的作者！","path":"about/index.html","date":"01-13","excerpt":""},{"title":"留言板","text":"","path":"comment/index.html","date":"01-13","excerpt":""},{"title":"赞赏","text":"如果喜欢我的博客，或者喜欢我的博客主题，可以考虑赞赏一下哦，非常感激！","path":"donate/index.html","date":"01-13","excerpt":""},{"title":"分类","text":"","path":"category/index.html","date":"01-01","excerpt":""},{"title":"友情链接","text":"欢迎各位朋友前来交换友链，本站友链接受以下类型的网站： 个人博客 公益组织等非盈利性网站 不接受广告、商业性网站，特殊情况除外 如果你的网站 一个月以上无法正常访问 将会被移除。","path":"friend/index.html","date":"01-01","excerpt":""},{"title":"标签","text":"","path":"tag/index.html","date":"01-01","excerpt":""}],"posts":[{"title":"什么是思维And如何思考","text":"现象的表面是一个节点，而思维是一个链条。 向上可以挖掘事物的根本原因 向下可以推断事物的发展结果 # 分析案例 # 1234567891011121314151617181920212223242526例子：限电政策的推行 why1：为什么突然开始限电 ans1：发电能源紧缺，发电需要成本 why2：为什么能源突然紧缺 ans2：疫情原因，外贸订单涌入 why3：为什么外贸订单会激增 ans3：因为全球疫情影响下，我国生产力远比其他各国稳定，产品出口增加 why4：产品出口增加为什么不是件好事 ans4：从国民经济层面出发，我国大量的出口产品需要经过多个生产环节并且消耗大量的自然资源和能源 （石油，煤炭...），当我们仅为一时的利润而出现对自然资源的过度开采，当真正到了匮乏的那天， 唯一的办法只会是进口原料，若此时国外抬高对原料的出口价格，那么对国民经济会是致命的打击。相信大家应该可以理解为什么要限电了，同时也能明白习总书记说的“绿水青山就是金山银山”----------------------------------------------------------------------反过来： so1：疫情下预测国民经济的发展趋势 so2：我国生产力远高于世界其他各国 so3：外贸订单会激增 so4：能源消耗增加 预测:原料会有紧缺的趋势，需要出台相关政策实施国家宏观调控，做出预案 声明：本例子仅作为个人角度理解分析现象，并非代表不良意图 # 向上挖掘 向上挖掘原因是为了找到解决问题最优解 在挖掘事物根本原因时，若发现答案对解决问题没有意义就应该停止探讨（深度） 仅从限电政策出台来看，探讨疫情对生产力的影响似乎并不是解决问题的主线 探讨的方向应该往可控的方向推进，避免不可控的因素（广度） 在上述案例中，电作为二次能源价格受一次能源供求关系影响，对于国家而言可控因素有：电价、电量、产品出口量，不可控因素有：自然资源、国外疫情、外贸订单量、进口原料价格。而在可控因素中电价是民生，为下选；而电量间接影响产品出口量，为上选。 # 向下挖掘 向下挖掘原因是为了预测结果和预料发展趋势，以便做出相应措施 当某一级的概率低到对预案或者措施没有实际指导作用就可以停止了（深度） 1原料紧缺的下一级别是能源现状 使用率&gt;&gt;增长率 然而我们是无法制造原料的 当现状发展到一些所预测级别时，后面所预测的概率就会自动增加了（结合实际） # 系统性思考 不同视角看待问题会有不同结果，避免视角单一，需要全面、动态、深入思考。 1234纵观全貌而非局部看透结构而非表象看到变化而非静止条理清晰而非杂乱 关注事实和数据 列出数据陈述事实 凭情绪和情感判断 征求大家意见 观察感觉上的变化 充满希望正面思考 提出思考方案 陈述最终方案 谨慎小心保守行事 识别风险，沟通风险应对 标新立异天马行空 大胆寻求新的设想 把控整个思考过程 定义和描述问题 针对问题发问 概括和总结 # 动态思考 从线性思考到闭环思考，因果并非线性，该因之果可能是他果的因 例子： 员工效率低下导致项目延期，需要员工加班，员工产生抵触情绪，进而效率更低，项目延期更久 # 深入思考 从表面事件到系统结构，思考个别事件反映到系统的问题 例子： 一个员工离职可能是员工问题，多个员工离职就需要考虑是否是管理结构和公司氛围的问题 # 深入思考 从本位局限到关照全局、 例子： 你所在部门调整了工作流程，对接的部门也需要随之调整工作流程，平行部门也会妒忌 # 结构性思考 从事物的结构层面出发，来引导思维和组织表达的思维模式 明确思考主题：思考有焦点，结论要先行，做事有目的 归纳分组：空间框架（逻辑顺序）+ 时间框架（时间阶段） 逻辑递进：主题 -&gt; 方案 -&gt; 执行细节 # 结论 思维决定出路，人和人的差距很可能就是思维上的差距","path":"2021/10/10/什么是思维and如何思考/","date":"10-10","excerpt":"","tags":[{"name":"Strange knowledge","slug":"Strange-knowledge","permalink":"http://mingkonic.work/tags/Strange-knowledge/"}]},{"title":"Keil5 由AC5👉AC6编译的转变（HAL库）","text":"# 为何转变 AC5 和 AC6 编译速度不同（不生成 Browser Message，两者编译速度差异不大） 两者编译后代码量不同 AC6 可以不需要编译即可访问函数或变量定义 AC5 采用的是 GCC 编译，而 AC6 采用 Clang 编译 简而言之 AC6 是官方在 AC5 基础上对库代码的架构优化 # 软件准备 Win10 环境（面临即将出的 11 不保证） Keil 5 5.30 以上皆可 （本次测试是在 5.36） cubemx 6.0.1 以上 （本次测试是在 6.30 且 FW 1.26.1 ） FreeRTOS CMSIS_RTOS_V1 # 转换步骤 Cubemx 生成基础工程 （随便初始化几个外设） 生成 Keil5 工程并从魔术棒更改编译选项 采用 AC6 选项后，可以看到 C/C++ 栏目多了很多配置选项，这里我们默认不作改动 发现报错和查看报错原因 喜提一堆报错，但查看每个报错原因，全是库函数无法被识别引起，然而在AC5却没有任何的报错情况，证明不是我们的问题，原因来自于更换编译器后无法正常编译旧的库架构。 替换 HAL 库 FW 的文件（解决办法之一） 网上大致存在两种解决办法，一种是手动修改库函数的的架构（不推荐，容易引发雪崩），而另一种就是简单粗暴的库替换覆盖，本次介绍的是第二种方法。 我们需要找到Cubemx中FW库存在的路径，一般会默认存放在系统盘（好像是改不了的）例如C:\\Users\\Administrator\\STM32Cube\\Repository\\STM32Cube_FW_F4_V1.26.1\\Middlewares\\Third_Party\\FreeRTOS\\Source\\portable 注意：采用哪个版本的库就进去哪个版本的库进行修改，如上所示 点击查看 GCC 文件夹，并复制 ARM_CM4F 文件夹 然后进入到 RVDS 文件夹，粘贴覆盖掉同名文件夹 完成该步骤后就可以重新进入 Cubemx 再生成一次项目工程覆盖掉，并采用 AC6 编译即可 编译成功 用时仅用 3s，告别编译 HAL 库几分钟的艰辛！！！ # 写在最后 因测试条件有限（回家没板子），并未烧录到板子进行测试，后续会测试 手动修改库函数（复杂，修改多），替换源库文件（便捷快速） 一个坑：若找上述方法修改源库文件或者是手动修改过源库文件后，可以实现 AC6 编译，但若再用回 AC5 编译，则会报错！！！鱼和熊掌不可兼得（我淦，这兼容性貌似有点离谱） 依据目前的测试情况，建议不打算完全舍弃 AC5 编译的暂时还是停留在 AC5，若做好转换成 AC6 编译可以采用本次教程进行转换。 团队协作研发的话，建议板子实测无重大问题 bug 后，可以考虑后续代码规范统一采用 AC6 编译器。 后面会继续尝试和探索更完美的办法 标准库的类似教程后面也会做出（OS：应该大概可能不会有人还用标准库吧）","path":"2021/10/05/Keil5 由AC5👉AC6编译的转变（HAL库）/","date":"10-05","excerpt":"","tags":[{"name":"Keil5","slug":"Keil5","permalink":"http://mingkonic.work/tags/Keil5/"}]},{"title":"怎么安慰你的朋友","text":"# Comfort skills 安慰技巧 人悲伤的五个阶段👀️ 否认（Denial） 愤怒（Anger） 祈求（Bargaining） 沮丧（Depressing） 接受（Acceptance） 举个栗子 情景：好闺蜜男朋友要和她分手 否认阶段😱： 什么，他居然要和我分手（震惊） 怎么会呢（拒绝接受现实） 愤怒阶段👎： 这个 xx 脑子是不是被驴踢了（愤怒情绪） 还是劈腿了（负面评价） 祈求阶段😫： 唉，是不是我哪里不够好才会这样（懊悔） 要是我当初…（祈求） 沮丧阶段😕 ： 闷闷不乐（低落） 吃不下饭，睡不好觉（低迷） 接受阶段😄 ： 接受分手的事实（走出悲伤） 开始新的生活（积极乐观） 如何安慰 帮助对方面对自己的情绪 （听她发泄完情绪） 给 ta 一些客观的建议和想法 （帮助 ta 正确认识问题） 陪伴在 ta 身边 （帮 ta 度过悲伤阶段） 等待 ta 接受现实 （重新开始新的生活） 总体流程：聆听 / 倾听 -&gt; 建议 -&gt; 陪伴 1234567禁忌👎： 不要太代入自己的经历！ （容易忽略朋友的真实感受，点到为止） 不要一上来就正能量！ （容易被对方看成是敷衍，理性放最后） 不要无视对方情感需求！ （否认对方情绪状态，等待主动寻求建议） 123456789101112万能语句👍 ： 想要聊聊吗？ 没关系，我在这陪着你，愿意听你说 你现在感觉怎么样？ 这很不容易，但你已经做得很好了 你怎么看待这件事情呢 我相信你能处理好这件事情，但如果你需要帮助的话，我随时都在 我尊重你的选择 没事，我会一直陪在你的身边 # 12345如果你总想着要掌握安慰别人的最好方式特别是因为想要避免说什么或做什么而感到焦虑时就很难意识到善意本身的价值Companion is also a kind of power！ -from《恰到好处的安慰》","path":"2021/09/16/How to comfort your friend/","date":"09-16","excerpt":"","tags":[{"name":"Strange knowledge","slug":"Strange-knowledge","permalink":"http://mingkonic.work/tags/Strange-knowledge/"}]},{"title":"初心","text":"# 赛后感想 # 前言 Who am I ? 我是一名普通的华广机器人野狼队电控组成员。 #初见 刚开学那会参观野狼队实验室，看到了追光的师兄们和炫酷的机器人，便一眼就认准了这里。 “师弟，要来这里玩吗，这有很炫的机器人和比赛喔”😄 有满屏看不懂的代码、有满地的工具零件、还有一群嘻嘻哈哈的人… #初出茅庐 18 年以实习生身份进入电控组实习；期间我学到了很多有趣好玩的技术知识，也认识了一伙人。 “哎～哎，干嘛，怎么搞不定啊，能不能行”😕 第一台机器人跑起来喜悦、第一次线下见到赛场的样子、一群好家伙们… #梦的开始 19 年开始以正式成员身份和那一伙人备战次年六月份的 RoboMaster 机甲大师赛。 “抓紧了，抓紧了，进度进度… 比赛就快到了”🚀️ 步兵出车的激动、抢车调的快乐、Debug 的忧愁、不知疲倦的熬夜 #戛然而止 19 年底，很不幸，新冠疫情爆发了，本以为是像一场大型流感那样… “例会啊，必须参加，步兵… 步兵先说… ，进度到哪了 ❓” 谁也没想到不准返校了，比赛由线下转为线上了，我们都曾抱着还能线下参赛的期待… 后来的后来，线上教学了一学期，比赛也在线上结束掉了 😢 #从心启航 20 年 8 月份距离返校还有一个月左右，队内静静地开始了换届… 此时已经阔别了机器人、实验室已经半年有余，好像大家伙都少了激情和热血，包括 我 也是 💔 maybe 因为疫情，大家的激情都被消磨殆尽 直到钰浩师兄和我提起队伍接下来的事情，我深思了很久很久… “甘心吗？不甘心！” “遗憾吗？挺遗憾！” “我还想再去一次赛场，这次是以参赛队员的身份。” 也和好家伙们达成了共识 这次，一如既往从心出发 ❤️ # 伊始 8 月底回校后，创新师兄召集了一群人开会明确大家的意向 有人选择留下，也有人选择离去… 最后剩下来的人也并不是很多 大家一起都将实验室收拾了一番，算是一个新的开始 被任命队长的同时，队伍也迎来一位人美心善的项管–赖小牛 #一个新的赛季就此开始… 🚀️ 报名参赛～也意味着接下来的一年里要和我的好家伙们以及大二的狼崽们并肩作战 规则发布～是一切研发的伊始 研读规则是我们必经的道路 第一次赛季规划会议或许不是很完美 because of new team 我开始有点惊慌、焦虑，怕无法带大家成功获得参赛资格 第二次赛季规划会议已是有了目标的雏形 但没有很清晰 导致大家后面一步一步走得艰难 后来 我、晁均、晓柔历经两日三夜终究还是交付了一份 “不完美” 的赛季规划文档给官方 我们都明白，如果这个节点过不了，那么后面就不用参赛了… 没有如释重负，反而眉头紧锁… 🤕 因为它的 “不完美” 会决定了官方是否会让我们获得进一步的资格 低迷、质疑环绕在我的身边… 熬过了那段时间，后来收到的也是好消息 内心却是笑不出来，后来也明白 规划 规划 是大家一起做的，并不是几个人就能做完的 #第一次喜悦 依旧记得那是一群人，各司其职用着电脑搜索着规则测评的答案 最后围在我的电脑前，一起见证测评的分数 “92 分，过了！” 一次过，我还记得喊得最大声的还是徐玺 那时的我也笑了，压抑的内心舒缓了许多，那一刻，那群人，我好像看到师兄们的影子 👪 团结、迅速、精准… 这是野狼的特性 后来，兵种的研发也陆续的开始 🔨 队伍也开始走上了 20 赛季的正轨 👀️ # 追逐 “步兵要飞坡，要自适应，要…” “英雄要飞坡，要连发，要…” “工程要连夹，要刷卡，要存储，要…” 好像一切都很合理，但并没有考虑到成本、精力以及时间 📆 他们大二，但其实他们也少了半学期，并没有从我们这一届学到很多东西，赶鸭子上架 狼崽之间因为缺乏半学期的接触，彼此之间也有点陌生 😕 富含想象力、追求完美设计… 是狼崽的特征 保守、求稳是我们这些老狼的特质 两者在意见与观念上的冲突争夺的有来有回 🏎 ，二者没有是非对错，只因老狼源于经历，而狼崽源于梦想 我也曾怀疑过我们是不是还在固步自封，没有勇敢的去尝试，或者说失去了尝试的勇气 就这样不同组狼崽之间和狼崽与老狼之间产生了一些隔阂，为此也花费了许多时间协调了很久… 很久… #研发进行时 面临着官方第二大考核，狼群一度低迷 😿 机器人设计了因各种问题拖延迟迟不能出车 问题就在于最初他们设计的时候我们身为老狼未能为他们指出不合理的地方 倘若在最初他们设计的时候能及时提出问题，帮助他们解决，是不是会比现在好点 可惜没有如果，我在机械方面的能力几乎没有，也是边看边学… 曾见过乌黑的装配室里两三人忙碌的身影，零星 “呯～呯…” 的敲打声 ⚒ 曾见到加工房里，加工机器运作的 “隆～隆…” 声 📣 曾见过光亮的外面通道时不时有一缕一缕的白烟伴随着 “嘶～嘶…” 的声音缓缓升起 大棚下的灯火通明，照亮着队员们面对着一行行代码调试着机器人的脸庞 听着午夜外面此起彼伏的声声虫鸣，似乎是一种享受 后来，我们用熬夜换来的时间赛跑，也得偿所愿，把中期应付过去了… 对没错，是应付… 用那充满瑕疵的所谓的一代车 😕 #脚踏实地、仰望星空 带着群狼与虎谋食，酸奶结义，为彼此共同加油，共同期待着相遇国赛的那天 🎉️ 交流是狼群进步的途径，冲进国赛是我们拼命的动力 联盟赛后，所获所得，所感所叹，大家好像都达成了默契 👍 二代研发也有了方向，该怎么取舍似乎在心中已经有了答案 大家默默地都在朝着自己的目标努力… 少了争吵与嫌弃，团结协作一起解决问题 忘不了那最后一个月，群狼全力以赴的身影 👪 “欧耶，拨盘不卡了” “预测有效果了，能行！再调调…” 寄予厚望的大风车，也在晁均的努力下终于成功激活 👊 当时举着手机录像的我看着手舞足蹈的他，内心也激动不已，因为我们皆知这份成功的不易 对于我们，最害怕的英雄从出发一周前开始，机械组的狼崽们已经开始了生命接力 💥 “你弄防护，我弄拨盘” “主动式顶针我来搞定！” “焊接我来！” 他们各司其职，尽自己最大的努力拯救着英雄机器人 🤖 此时距离比赛出发仅剩几天… （还是挺担忧） 最后，在出发的前一晚 🌔 英雄、备用步兵… 都在他们的努力下赶工出来了，不管之前有多么的不尽人意，但最终他们也都做到了 👍 那段时间，无论是加工房还是大棚，只要是黑夜中的光亮，那必有他们努力的身影 依然记得取得突破时，他们脸上喜悦的笑容 😄 有那么一瞬间，我感受到以前实验室的那种氛围 🐺 我以为他们回来了…🏃 而我们也该出发了 🚌 # 迎战 出发那天，看着大包小包的东西被装着上车，直到车启动的那一刻我看着实验室的方向 🏢 好像总感觉缺点啥… 可能就是 “准备”，我总感觉没准备好就要上战场了，更多的是不安 又或许是昨晚熬夜后的焦虑，以至于车上我也没敢坐下来放松片刻 😟 到了春茧体育馆后，与晓柔一起去随队对接报到的手续，随后便进入了属于我们队伍的备场区域 不敢丝毫松懈，因为下午便是预检录，按照联盟赛的经验，预检录是最能发现机器人所存在的问题 光泽度、裁判系统主控安装规范等，是那天下午暴露出来的问题，所幸的是解决起来并不难 但是英雄接线问题的隐患却留到了第二天的适应性训练才发现… 当天也让他们准备好自己适应性训练所需要检查的功能清单 📄 然而由于英雄接线隐患未被及时发现，导致本来训练时间少的英雄，在适应性训练的时候一直无法动弹 在英雄失去这个难得机会的同时，加上他们所谓的 “准备好了” 的准备也并没有得到很好的体现 当时，我没绷住，回来将他们怒斥了一顿，不得不承认我情绪化了，没考虑到大家都一样是第一次参加线下赛 随后调整过来后还是一起帮忙解决现有的问题 👀️ 领队会议的抽签，秉承着队伍以往的好运与惯例，我们与福工、重庆理工、厦门理工一起在 F 组 就抽签而言，面对小组的对手都有很大的胜算，出线的概率很大，前提是我们的机器人足够稳定 🤖 担心和顾虑都在第一场对战重庆理工时得到验证 “工程夹子出不来，CAN 线掉了” 这也意味着这局，我们的战术得变成低保局的打法 在候场观战席我看到了大家因为出问题而紧张的神情，庭辉也是紧握双拳，整个人都在那抖，焦躁不安 😕 配合方面也都还需要磨合，虽然我们侥幸赢得比赛的胜利，但大家脸色都不好，因为自己也有问题要解决 稳定，做到了出线并不难 🎏 在逐一将问题都解决后，下一场面对厦门理工时，也打出了队伍的气势和战术体系应有的样子 这一场胜利已经奠定了出现的基础，队伍的自信和气势也找了回来 出线则是遇上广工或者川大，这取决于我们是否能打赢福工 在当时打赢福工对上广工是我们拿到国赛门票的最优战略 然而对战福工的时候因为团队上的一些失误导致和福工打平，最后视伤害来排名，福工第一，我们第二 当时整个队伍有些失落，不是因为我们是第二，而是因为我们没能拿到那个最优解 🖊 川大，19 年复活赛断绝了我们队伍进入国赛的希望，师兄们的遗憾 而今年此时此刻，又遇到川大… 好像队伍蒙上了一层阴翳 “又不是不能打，凭我们的车可以赢！” 往年的失利，今年讨回来！这是我们共同的约定 😉 操作手们商量着战术，技术组检修着自己的战车，大家都铆足了劲 👊 午饭后当我下去挨个兵种查看是否有问题时，看着他们忙碌的样子，我想 “可以的，一定可以赢” “没有谁是天生的王者，但想赢是天生的” # 圆梦 在进入候场后，即将开赛前，我望着他们，望了望赛场，心里笃定我们一定还可以走得更远 在一轮加油打气后，我们的战斗也开始了… “嗖… 嗖… 嗖… 嗖…”，四发划破天际的飞镖直奔我们的前哨战，并把我们前哨战打掉 这仅是开场两分钟的时间，坐在观战席的我们有些吃惊 😱 这也导致了我们操作手们有些惊慌，也出现了一台机器人下坎翻车，随后第一小局也被对面拿下了 我心想着 “还有机会”，在第二小局的准备时段，把刚刚在观战席看到的信息传递给了晁均，让他及时调整战术 这时，群里加油的声音迭起… “冲他丫的” “坏了我给你焊” “坏了，老子通宵修” “…” 外边的伙伴和我们相信操作手们，操作手相信着研发的伙伴们，共同面对我们强大的对手 👊 这次我们拒绝成为火锅底料 🍖 川大的飞镖在后面两场也是一如既往的准 🚀️ 调整后的第二小局，我们抓住了对面地面力量的薄弱，通过后面的运营稳稳的拿到了胜利 这时，我们都已经激动无比，因为获胜的方法已经找到，而国赛的门票就在眼前 在第二小局获胜的气势下，操作手们依然不受对方飞镖效果的影响，复刻前一局的运营，稳健的拿下了比赛 成功完成让一追二 👍 我仍记得当时倒计时 10s 结束比赛前，观战席的他们无法按捺住的激动，哪怕隔着口罩也能感受都他们的喜悦 操作手出来跑起来带风的感觉，我望着手舞足蹈兴奋的他们，慢慢的走向他们，那是属于我们的胜利 当我签署成绩确认书的那一刻，我确信我们做到了，无论之前我们有多么的不被看好 从南部的小组赛出线到十六强到南部八强，这一步真的不容易，我们花了两年时间才迈出这一步。 # 完结 进了国赛… 新的对手中部亚军浙大、安徽信息工程、北科技，都说国赛无弱队，事实上也是如此 五号步兵的缺席成了最大的遗憾，步兵的负责人是我，没有做好赛前检查，辜负队友和队伍的期待 💔 本着赢了就是赚，输了也不亏的心态，队伍打出了气势，即便如此，技术上的差距是无法弥补… … 比赛结束，梦却还在继续 次日早上梦中惊醒是赛场上比赛开始时的倒计时… 好像过去了又好像没过去 刚接手队伍的时候，很害怕这个队伍被我们这一届带没了 💔 （因为 18 年的我小白，20 年的我可以独当一面，从无到有，与我而言最重要便是这个实验室以及实验室你的人） 今年这一年下来，身为队长有好多地方都没做好，我也想做好… 或许你们觉得我很凶 又或者是觉得我不通情达理 … 我还是希望和大家成为伙伴或朋友 👪 感谢你们一年以来的支持、付出和理解 最后的最后，无关身份，我想感谢 18 年至今实验室里的每一个人，你们的出现是我大学生活里最惊艳的一笔 队伍接下来交给你们了，团结才是你们最帅的样子，加油吧！继续努力下去，开心地做好每一场比赛 (hope：实验室应该还会是那个有说有笑的样子吧…) Write on 2021.08.15","path":"2021/08/16/original_aspiration/","date":"08-16","excerpt":"","tags":[{"name":"Wolf Team","slug":"Wolf-Team","permalink":"http://mingkonic.work/tags/Wolf-Team/"}]},{"title":"人才们的思维","text":"# Mode of Thinking 思维方式 第五流人才：怨妇 理解层次：环境（最低层） 思考模式：问题的出现归结于环境问题 It’s all your fault ! 解决途径：改变身处环境 举个栗子：工作不顺利，换公司 典型表现：逃避 第四流人才：行动派 理解层次：行动（次低层） 思考模式：问题的出现归结于自身问题 Not work hard enough ！ 解决途径：比以往更加努力 举个栗子：工资涨不快，不够努力 （努力是成功的必要不充分条件) 典型表现：盲卷 第三流人才：战术家 理解层次：能力（中间层） 思考模式：办法总比问题多 There are always more solutions than the problems ！ 解决途径：寻找更好的方法 举个栗子：因沟通问题，去学习改善沟通技巧 典型表现：应用 第二流人才：战略家 理解层次：BVR 信念 | 价值观 | 规条（次高层） 信念： 你相信什么是对的 概念 -&gt; 世界观 价值观： 事物价值的区分 价值排序 规条： 做人做事的原则 高效选择 思考模式：什么才是更重要的 What is even more important ？ 解决途径：分析问题的出现原因，寻求核心方法 举个栗子：导致业绩下滑有什么显著原因？什么潜在原因？ 成本、团队、市场、营销、渠道 典型表现：决策 第一流人才：觉醒者 理解层次：身份（最高层） 思考模式：我是什么身份？我会什么？ What am I and what I am ？ 解决途径：冲破角色束缚 举个栗子：你想成为某品牌创始人，你会寻找代工厂 典型表现：定位 顶级人才：领袖 理解层次：精神 / 使命（顶层） 思考模式：改变世界 解决途径：逆境创新 举个栗子：引领时代变迁的伟人 典型表现：利他 # 总结 面对是解决问题的基础。 Courage 方法是解决问题的捷径。 Road 分析是解决问题的利器。 Weapon 定位是去角色化，冲破角色束缚。 Identity 精神是逆境前行中的光芒。 Linght 高层级以低层级为基础，无法跳脱单独存在。 人的发展就是在以上层级中发展，人与人的区别或许只是来自于发展所需时长的差异。 time ：2021.07.13 autor：Mingkonic type ：tittle-tattle","path":"2021/07/13/thought/","date":"07-13","excerpt":"","tags":[{"name":"Strange knowledge","slug":"Strange-knowledge","permalink":"http://mingkonic.work/tags/Strange-knowledge/"}]},{"title":"Hello World","text":"第一次来到这里！ 得闲一起 857…","path":"2021/01/13/hello-world/","date":"01-13","excerpt":"","tags":[]},{"title":"Matlab的妙用","text":"# Matlab 妙用一：利用数据拟合曲线 本次讲解基于 Matlab2018b 众所周知，我们有时候得到的一些系列数据，若人为处理计算过于繁琐🤪，需要借助 matlab 对你所得到的的数据进行分析，得到其中内在的联系，并且还能得出表达式以及拟合出来曲线模型的可靠程度，通过这个方法可以很快得到一些数学模型，从而应用于开发中 前提条件：是 Matlab 就行🤔 # 第一步：既然是数据拟合，那就必须要有数据。请允许我先捏造一段数据🤪不出意外这会是线性的 还是得说一下数据的导入方式： 1. 手动输入😒：此方式最直接，命令行输入就行，但工作量也最大🤣 2. 表格导入：推荐是这种，现在几乎上位机等这些软件都能导出数据表格.csv 的格式👏 举个栗子 点击 导入数据 按钮 选择你所要导入的数据表格文件，支持 .csv，.xls 以及 .txt 等众多格式 注意：推荐导出的方式是 数值矩阵 ，便于转换和后续操作 选择导入后你会在工作区，看到你保存的数据 在导入数据后，可以点开双击点开工作区里面的变量来查看数据，可以检查数据是否导入正常，目前我还没出现过异常的情况。此外可以对其中某个数据进行修改或删除操作。 # 第二步：在数据无误的情况下，唤醒神灯🗽（Curve Fitting）并放入数据 在命令行输入 cftool 或者 上方 App 更多找到 Curve Fitting 工具箱面板介绍 分析小组件 移动查看类 选择分析类 曲线类型 A. 自定义方程 Custom Equation😃 B. 指数函数 Exponential😃 C. 傅里叶级数 Fourier😃 D. 高斯分布 Gaussian😶 E. 插值逼近 Interpolant 也即是分段的多项式拟合😑 F. 线性拟合 Linear Fitting 一种特殊的自定义函数，根据实体数据来😑 G. 多项式 Polynomial🤩 H. 幂函数 Power🤨 I. 有理数逼近 Rational J. 平滑曲线 Smooting Spline（滤波）🤐 K. 正弦和 Sum of Sine🤨 L. 韦布尔分布 Weibull🙃 连线都没，绝了！ 在得到你想要的的曲线模型后，你就可以应用于你的程序算法开发中，这个作为 Matlab 的小功能对你的数据处理提供一定的帮助，再也不用面对数据无厘头地瞎忙活🤣。","path":"2021/01/13/magical_effect/","date":"01-13","excerpt":"","tags":[{"name":"Matlab","slug":"Matlab","permalink":"http://mingkonic.work/tags/Matlab/"}]}],"categories":[],"tags":[{"name":"Strange knowledge","slug":"Strange-knowledge","permalink":"http://mingkonic.work/tags/Strange-knowledge/"},{"name":"Keil5","slug":"Keil5","permalink":"http://mingkonic.work/tags/Keil5/"},{"name":"Wolf Team","slug":"Wolf-Team","permalink":"http://mingkonic.work/tags/Wolf-Team/"},{"name":"Matlab","slug":"Matlab","permalink":"http://mingkonic.work/tags/Matlab/"}]}